In [4]:
import numpy as np
import pandas as pd

In [5]:
from sklearn.ensemble import RandomForestClassifier

In [6]:
from sklearn.cross_validation import train_test_split

In [8]:
pd.options.mode.chained_assignment = None

In [9]:
from sklearn.externals import joblib

In [10]:
data = pd.read_csv("titanic_train.csv")
data.head()

,Unnamed: 0,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,998,999,3rd,1,"McCarthy, Miss Katie",NaN,NaN,NaN,NaN,NaN,NaN,female
1,179,180,1st,0,"Millet, Mr Francis Davis",65.0,Southampton,"East Bridgewater, MA",NaN,NaN,(249),male
2,556,557,2nd,0,"Sjostedt, Mr Ernst Adolf",59.0,Southampton,"Sault St Marie, ON",NaN,NaN,NaN,male
3,174,175,1st,0,"McCaffry, Mr Thomas Francis",46.0,Cherbourg,"Vancouver, BC",NaN,NaN,(292),male
4,1232,1233,3rd,0,"Strilic, Mr Ivan",NaN,NaN,NaN,NaN,NaN,NaN,male

In [25]:
pd.options.display.float_format = '{:,.0f}'.format

In [11]:
median_age = data['age'].median()
print("Median age is {}".format(median_age))

Median age is 29.0

In [12]:
data['age'].fillna(median_age, inplace=True)
data['age'].head()

0    29.0
1    65.0
2    59.0
3    46.0
4    29.0
Name: age, dtype: float64

In [13]:
data.head()

,Unnamed: 0,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,998,999,3rd,1,"McCarthy, Miss Katie",29.0,NaN,NaN,NaN,NaN,NaN,female
1,179,180,1st,0,"Millet, Mr Francis Davis",65.0,Southampton,"East Bridgewater, MA",NaN,NaN,(249),male
2,556,557,2nd,0,"Sjostedt, Mr Ernst Adolf",59.0,Southampton,"Sault St Marie, ON",NaN,NaN,NaN,male
3,174,175,1st,0,"McCaffry, Mr Thomas Francis",46.0,Cherbourg,"Vancouver, BC",NaN,NaN,(292),male
4,1232,1233,3rd,0,"Strilic, Mr Ivan",29.0,NaN,NaN,NaN,NaN,NaN,male

In [14]:
data_inputs = data[["pclass","age","sex"]]
data_inputs.head()

  pclass   age     sex
0    3rd  29.0  female
1    1st  65.0    male
2    2nd  59.0    male
3    1st  46.0    male
4    3rd  29.0    male

In [15]:
expected_output = data[["survived"]]
expected_output.head()

   survived
0         1
1         0
2         0
3         0
4         0

In [16]:
data_inputs["pclass"].replace("3rd",3,inplace=True)
data_inputs["pclass"].replace("2nd",2,inplace=True)
data_inputs["pclass"].replace("1st",1,inplace=True)
data_inputs.head()

   pclass   age     sex
0       3  29.0  female
1       1  65.0    male
2       2  59.0    male
3       1  46.0    male
4       3  29.0    male

In [17]:
data_inputs["sex"] = np.where(data_inputs["sex"] == "female", 0, 1)
data_inputs.head()

   pclass   age  sex
0       3  29.0    0
1       1  65.0    1
2       2  59.0    1
3       1  46.0    1
4       3  29.0    1

In [20]:
inputs_train, inputs_test, expected_output_train, expected_output_test = train_test_split (data_inputs, expected_output, test_size = 0.33, random_state = 42)

In [21]:
rf = RandomForestClassifier (n_estimators=100)

In [31]:
rf.fit(inputs_train, expected_output_train.values.ravel())

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_split=1e-07, min_samples_leaf=1,
            min_samples_split=2, min_weight_fraction_leaf=0.0,
            n_estimators=100, n_jobs=1, oob_score=False, random_state=None,
            verbose=0, warm_start=False)

In [32]:
accuracy = rf.score(inputs_test, expected_output_test)
print("Accuracy = {}%".format(accuracy*100))

Accuracy = 78.28947368421053%

In [33]:
joblib.dump(rf, "titanic_survival_prediction_randomforest", compress=9)

['titanic_survival_prediction_randomforest']